/* Дана строка с несколькими строками текста, разделенными переводами строки.
 Напишите метод, который удаляет все пустые строки из текста. */

package lesson2.task3;

public class Task {
    public static void main(String[] args) {

    }
}

/*
 * class TextCleaner {
 * public static String removeEmptyLines(String text) {
 * // Введите свое решение ниже
 * }
 * }
 * // Не удаляйте этот класс-он нужен для вывода результатов на
 * экран и проверки
 * public class Printer {
 * public static void main(String[] args) {
 * String text = "";
 * if (args.length == 0) {
 * // При отправке кода на Выполнение, вы можете
 * варьировать эти параметры
 * text = "line1\n\nline2\n\nline3";
 * } else {
 * text = args[0];
 * }
 * TextCleaner ans = new TextCleaner();
 * System.out.println(ans.removeEmptyLines(text));
 * }
 * }
 */