/* Напишите метод printEvenNums, который выведет на экран 
все четные числа в промежутке от 1 до 100, каждое на новой строке. */

package lesson_1.task2;

public class Task {
    public static void main(String[] args) {
        Answer ans = new Answer();
        System.out.println("Четные числа от 1 до 100 включительно:");
        ans.printEvenNums();
    }
}
